package group

import (
	"encoding/json"
	"fmt"
	"github.com/stretchr/testify/assert"
	"testing"
)

func TestGroup(t *testing.T) {
	aq := assert.New(t)
	arr := make([]map[string]interface{}, 0)
	err := json.Unmarshal([]byte(s), &arr)
	aq.Nil(err)

	var sum float64
	for _, m := range arr {
		v := m["点击量"]
		vv := v.(float64)
		sum += vv
	}

	for _, m := range arr {
		v := m["点击量"]
		vv := v.(float64)
		ratio := vv / sum
		m["比例"] = ratio
	}

	fmt.Println("时段", "	", "点击量", "	", "比例")
	for _, m := range arr {
		v := m["比例"]
		vv := v.(float64)
		fmt.Println(m["小时"], "	", m["点击量"], "	", fmt.Sprintf("%.2f %%", vv*100))
	}

}

var s = `
[
    {
        "小时": "052700",
        "点击量": 9469
    },
    {
        "小时": "052701",
        "点击量": 3877
    },
    {
        "小时": "052702",
        "点击量": 2076
    },
    {
        "小时": "052703",
        "点击量": 1587
    },
    {
        "小时": "052704",
        "点击量": 2206
    },
    {
        "小时": "052705",
        "点击量": 6446
    },
    {
        "小时": "052706",
        "点击量": 12411
    },
    {
        "小时": "052707",
        "点击量": 10735
    },
    {
        "小时": "052708",
        "点击量": 6347
    },
    {
        "小时": "052709",
        "点击量": 4782
    },
    {
        "小时": "052710",
        "点击量": 3716
    },
    {
        "小时": "052711",
        "点击量": 3155
    },
    {
        "小时": "052712",
        "点击量": 2654
    },
    {
        "小时": "052713",
        "点击量": 2135
    },
    {
        "小时": "052714",
        "点击量": 1985
    },
    {
        "小时": "052715",
        "点击量": 1812
    },
    {
        "小时": "052716",
        "点击量": 1782
    },
    {
        "小时": "052717",
        "点击量": 1914
    },
    {
        "小时": "052718",
        "点击量": 1687
    },
    {
        "小时": "052719",
        "点击量": 1622
    },
    {
        "小时": "052720",
        "点击量": 1525
    },
    {
        "小时": "052721",
        "点击量": 1212
    },
    {
        "小时": "052722",
        "点击量": 903
    },
    {
        "小时": "052723",
        "点击量": 648
    }
]
	`
